<?php
    $name1 = "홍길동";
    $name2 = "이순신";

    $names = array("이순신", "홍길동", "정약용", "이도", "세종", "세조", "송시열");
    echo "$names[0]<br>";
    echo "$names[1]<br>";

    for($i=0; $i<count($names); $i++)
    {
        echo "$i : $names[$i]<br>";
    }

    $std = array();
    $std[] = "aaa";
    $std[] = "bbb";
    $std[] = "ccc";

    for($i=0; $i<count($std); $i++)
    {
        echo "$i : $std[$i]<br>";
    }

    $text = "서울,경기,충청,제주,강원";
    $words = explode(",", $text);

    $text = "水旱果天數乎。果人事乎。堯湯未免。天數也。休咎有徵。人事也。古之人修人事以應天數。故有九七年之厄而民不病。後之人委天數而廢人事。故一二年之灾。而民已轉于溝壑矣。國家非惟省歲月日。且有儲備。人事可謂修矣。自去年之水旱而民甚病。多方救療之不得其要。何哉。甞聞之父老。曰移民移粟。食飢飮渴。僅足以紓目前之急。若欲因其已然之迹而防 a003_101b其未然之患。盍亦究其原。夫民之寄命者有司。凡有利害。必赴而訴之。若子於父母。然父母之於子。祛其害而已。豈計其利己乎。今之有司則不然。設二人爭訟。甲若有錢。乙便無理。其民安得不死寃。其氣安得不傷和乎。此所由召水旱也。監有司曰監司。凡有貪廉。卽按而誅賞之。監監司曰監察。凡有賢否。卽察而黜陟之。今皆不然。間有志古者。反不見容於時。盖今日之監司。卽前日監察。今日之監察。卽前日有司。相扳援相蔽覆。故如此。苟使今之民。一見古之有司。今之有司。一見古之監司。今之監司。一見古之監察則 a003_101c吾赤子庶免溝壑矣。然則天數也人事也。其要去貪而已。如欲去貪則有成憲具在。擧而行之。在乎宰天下者耳。作原水旱。";
    $words = explode("。", $text);

    for($i=0; $i<count($words); $i++)
    {
        echo "$i : $words[$i]<br>";
    }

    



    
?>